print("Вы в подземелье")
choice = input("Направо или налево?")
if choice == "направо":
    print("Вы нашли сундук!")
    action = input("Открыть или пойти дальше") 
    if action == "открыть":
               print("Вы нашли золото!")
    else:
                print("Вы встретили гоблина")
                action2 = input("Атаковать или пройти мимо?")
                if action2 == "атаковать":
                    print("Гоблин повержен")
                    choice4 = input("Пойти к выходу или пойти дальше?")
                    if choice4 == "пойти к выходу":
                     print("Победа!")
                    if action2 == "пройти мимо":
                        print("Ты прошёл мимо гоблина")
                        choice2 = input("Пойти к выходу или пойти дальше?")
                        if choice2 == "пойти к выходу":
                            print("Победа!")
                            if choice2 == "пойти дальше":
                                print("Вас уничтожили гоблины")
else:
        print("Вас съел дракон")